{
  "pream": "__These are the instructions for adding questions for regular discussion on G+MM__\n\n* It is best to add your question in a direct message with @Jalendu. Direct message Jalendu as you would any real user.\n\n* Every request or instruction to the questions system starts with \"/qo\". This tells Jalendu (a program) that you are referring to the questions system.\n\n* Questions are asked in the channel anonymously and in random order but your user name is recorded with each question so that only you (or a mod) can edit the questions that you have added.\n\n* Questions can be as long or short as you like but try to make it something that invites discussion. You can add photos to your question. Questions can be controversial and push boundaries but keep in mind that they will be displayed in a sfw channel to invite maximum participation.",
  "users1": "__Adding a question__\n\nTo add a question, enter ```/qo add [your question]``` as a message.\n\nYou can attach a photo to your question if you want to. You can do this later with the attach command (see below) or at the same time as you add the question by clicking on the + to the left of the message field, selecting \"Upload a file\", choose your photo (or etc.) and press Open, enter ```/qo add [your question]``` in the ADD A COMMENT field and then press Upload.\n\nJalendu will reply with # plus the id of your question and the question itself. You will need the id number if you want to change the question you added.\n\n__Listing your questions__\n\nTo list the questions that you have previously added, enter ```/qo list [id]``` [id] refers to the question id number you saw after the question was added. If you leave it out, all of your questions will be listed as well as the question status the question status (submitted/approved/rejected/deleted) but not any images attached to them.\nYou only get the image if you list them one at a time which shows the question in the format in which it will be asked. \n\n__Finding a question__\n\nTo find only the questions that you have previously added that contain certain words, enter ```/qo find [words]```",
  "users2": "__Editing a question__\n\nTo edit the text of a previously entered question, enter ```/qo edit [id] [your revised question]```This will only change the question. If you attached a photo to your question, it will be unchanged.\n\n__Attaching a photo to a question__\n\nTo attach photo (or file) to a previously entered question, press the + on the left of the  message field, select \"Upload a file\", choose your photo (or etc.) then press Open, enter ```/qo attach [id]``` in the ADD A COMMENT field and then press Upload. This will only change the photo attached to the question, not the text of the question.\n\n__Detaching a photo from a question__\n\nTo remove the photo from a question while leaving the question itself intact, enter ```/qo detach [id]```\n__Deleting a question__\n\nTo delete your question, enter ```/qo delete [id]```\n__Undeleting a question__\n\nIt is possible to undelete a question if not too much time has passed since you deleted it. To get a list of deleted questions that are still recoverable, enter ```/qo deleted```To undelete your question, enter ```/qo undelete [id]```\n__Bumping a question__\n\nQuestions are inserted into the list in random order. To lower the order of a question so that it will come up sooner, enter ```/qo bump [id]```\n__System status__\n\nTo get information about the questions system including the number of questions left and the time of the next question, enter ```/qo status```\n__Help__\n\nTo get help about the questions system commands (that you are reading right now), enter ```/qo help```",
  "mods": "\n\n**__Moderator only commands__**\n\nAll of the commands available to general users (above) work for moderators but moderators can see and edit all questions, not just their own. Editing a user's question doesn't change their ownership of it so they can still edit it. Similarly deleting a user's question doesn't stop them undeleting it until a hard delete is done.\n\n__Reviewing Questions__\n\nWhen a question is added or edited, it goes into \"submitted\" status and is not yet available to be asked. They need to be approved before they can be asked. To read all of the questions needing approval enter ```/qo review```\n__Approval and rejection__\n\nEnter ```/qo approve [id|all]``` to approve the question with id, or 'all' to approve all submitted questions.\nTo reject a question, enter ```/qo reject [id]``` There is no 'all' option for reject.\n\n__Starting and stopping the questions system__\n\nEnter```/qo start [n]```To start the questions system in the current channel in [n] hours time. Leave out n to start immediately.\nTo stop the system, enter```/qo stop```\n__Questions Reset__\n\nToo make all questions available to be asked again, enter```/qo reset```\n__Shuffle Questions__\n\nTo resort the questions in random order, enter```/qo randomise [clear]``` The 'clear' option will zero all bumps.",
  "admin": "\n\n**__Admin only commands__**\n\nAdmin only commands should only be of interest to the bot developers:\n\n*init* is called when the bot starts. I reads objects from the replit database into memory. There should be no reason to call it manually.\nSimilarly *save* copies the in memory objects (actually only qotds) into the database.\n*fromjsonxxx*\n*tojson*\n*resetxxx*\n*deletexxx*\n"
}