{
  "active": true,
  "channelid": "871627629831290920",
  "lastasktime": "2021-10-12T07:28:44.831Z",
  "intervaldays": 7,
  "maxasked": 1,
  "nextid": 40,
  "questions": [
    {
      "id": 2,
      "question": "Do you perform any ritual before or after you practice meditation or yoga?",
      "asked": 1,
      "replies": 0,
      "addedby": "marq_andrew",
      "reviewedby": "marq_andrew",
      "askedtime": "2021-10-12T07:28:44.831Z",
      "random": 0.01745845565074955,
      "status": "approved",
      "messageid": {}
    },
    {
      "id": 23,
      "question": "Henry Scott Tuke (1858-1929) was an English painter. He had no known relationships with women other than his sister. He was friends with Oscar Wilde and other \"Uranians\" and wrote poetry that idealised the love of Ancient Greece. Since the 1970's he has become \" something of a cult figure in gay cultural circles\" and Elton John has a large collection of his works (-for some reason-). There is however no direct evidence that he was gay and a small number of Tuke curators push back at any suggestion that he was or that his art is homoerotic.\nWhat do you feel about “gay erasure” of historical figures? Is it important to oppose it or do gay people make too much fuss about it?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": "2021-10-12T07:26:13.203Z",
      "random": 0.03527196341258532,
      "attachment": "https://cdn.discordapp.com/attachments/886468028320055326/896621411068690432/398A160B-8B44-4D21-B25A-8B78167815E6_4_5005_c.jpeg"
    },
    {
      "id": 16,
      "question": "You often hear the phrase “body and soul” but gay poet Walt Whitman in his poem “I Sing the Body Electric” defined the soul as the body. What do you think about terms like ”body” versus “soul” and “spirit”? How does the body and the individual aspects of our embodiment; our race, gender, sexuality, age, personality, health, intelligence, ability etc. relate to spirituality? Is spirituality even an appropriate word?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.08722988891082384
    },
    {
      "id": 32,
      "question": "What was your first contact with meditation? How old were you when you first meditated?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.16178378961790685
    },
    {
      "id": 9,
      "question": "The Discord Community Guidelines prohibit the \"sexualisation of minors (age 13-17) in any way.\" It has been suggested that a Discord group focussed on minority sexualities (such as this one) sexualises minors just by them being allowed to join. Given that young teenagers are sexual well before their 18th birthday, what does the term \"sexualisation of minors\" mean? Can a gay+ adult engage with a gay+ teen who has questions about sex and sexuality in a positive, constructive way or is any engagement at all online simply taboo?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.19585223399293938,
      "status": "approved"
    },
    {
      "id": 31,
      "question": "It has been said that religion gives people a moral compass and that people who are atheist or irreligious are therefor less moral. What do you think?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.2674938431829652
    },
    {
      "id": 30,
      "question": "Do you believe in God, gods or any supernatural beings? How does your belief or lack of it affect your life?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.3007027245170093
    },
    {
      "id": 35,
      "question": "In many places there has been a decline in the number of venues like pubs, clubs and gyms exclusively for gay and lesbian people, often replaced by venues that are explicitly gay friendly but open to everyone. On the other hand, more and more groups exclusively for lgbt people are appearing on Discord. Is it good or bad?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.30820137611620213
    },
    {
      "id": 7,
      "question": "Can meditation give you magical, paranormal or supernatural abilities?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.31037317877296267,
      "status": "approved"
    },
    {
      "id": 6,
      "question": "Do you think meditation improves your sex life? In what ways?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.4208696436085333,
      "status": "approved"
    },
    {
      "id": 21,
      "question": "\"Beliefs are a choice. If you find you are being discriminated against because of your beliefs, change them. The same can’t be said for race, gender, age and sexuality. It’s time to end the false equivalency.\" \nDo you agree? Is it ok to discriminate against a person because of their religious beliefs? On the other hand, is it rational to allow someone an exemption from the law on the basis of what they choose to believe?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.4237412505237632
    },
    {
      "id": 39,
      "question": "I’ve heard of Tantric sex but I don’t know much about it. Is it mindful masturbation or sex? Edging? Sex without ejaculating? Having multiple orgasms? What exactly is it about?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.4400426752011113
    },
    {
      "id": 24,
      "question": "Do you ever experience sexual arousal during meditation or yoga even though you are not seeing or thinking anything sexual? Do you find it distracting? To what do you attribute it?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.4440367111106045
    },
    {
      "id": 22,
      "question": "The word \"homosexual\" first appeared in print in 1869 and then only became well known after 1886; a product of contemporary psychological theories of the subconscious mind. Oscar Wilde and his circle referred to themselves as \"Uranians\", men inhabited by female spirits. How then do we see the word \"homosexual\" printed in modern English translations of the Bible?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.4457270377501854
    },
    {
      "id": 38,
      "question": "How would you describe meditation to someone who doesn’t know anything about it?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.4482164773834445
    },
    {
      "id": 11,
      "question": "How do you feel about nude yoga or meditation? Do you or would you practice nude alone, with others or online on camera?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.4821063703975472,
      "status": "approved"
    },
    {
      "id": 27,
      "question": "You often hear people say that everyone has a right to their opinions. Is it true? Some opinions, like that the earth is flat or that the moon is made of cheese are wrong. Do people have a right to hold opinions that have been proven to be wrong?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.5452358295749609,
      "attachment": "https://cdn.discordapp.com/attachments/886468028320055326/896837529570013194/09836-scicon8-moon.jpg"
    },
    {
      "id": 36,
      "question": "Are you superstitious? If so in what ways? Do you observe any superstitions even though you don’t believe in them like saying “bless you” when someone sneezes?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.5488105765115192
    },
    {
      "id": 25,
      "question": "What do you think about social media algorithms on platforms like Facebook and Twitter that suggest connections with “like-minded” people (with the same opinions, political views, interests) and allow people they disagree with to be blocked?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.6517990703347392
    },
    {
      "id": 26,
      "question": "“The customer rang and said that they’re coming in this afternoon to pick up their order. I thanked them for their patience.”\nUsing the pronouns they, their and them for a single person is common and correct English usage, usually when you don’t know their gender. Why is it then that when a person says that they’d prefer others to refer to them using those pronouns (they/their/them), some people object on the grounds that it doesn’t seem to be correct grammar to refer to a single person using them?\nIf you speak another language, what pronouns do you use for a person when you don’t know their gender?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.6707717742737622
    },
    {
      "id": 29,
      "question": "Antinous was the lover of the Roman Emperor Hadrian. He tragically drowned in the Nile when not yet 20. He was praised for his beauty and numerous statues and even temples where built to him. It seems that in the Roman world, men were praised for their beauty more than women.\nWhy do you think this changed? Do you feel comfortable calling a man \"beautiful\"? Do you think that men are in fact generally more beautiful than women and that it has nothing to do with your sexuality? Is the fact that in many species of animal, the males are more attractive than the females relevant?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.6856191137253842,
      "attachment": "https://cdn.discordapp.com/attachments/886468028320055326/896842991614963753/0024MAN-Antinous.jpg"
    },
    {
      "id": 12,
      "question": "How does being gay+ (gay, bisexual, pansexual or bi-curious) influence your meditation or yoga practice? Did it influence your decision to start?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.7075574855884474,
      "status": "approved"
    },
    {
      "id": 8,
      "question": "Do you practice yoga as a form of physical excercise, a spiritual practice or both? Is there a difference?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.7110145697893417,
      "status": "approved"
    },
    {
      "id": 14,
      "question": "How do you cope with meditation or yoga in a noisy place?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.7151056596803733
    },
    {
      "id": 10,
      "question": "Have you ever experenced lucid dreaming? Do you have or know a practice that can cause lucid dreaming? If you could lucid dream, what would you do in your dream?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.8000265148873653,
      "status": "approved"
    },
    {
      "id": 34,
      "question": "Do you use music, guided meditations, white noise or things like that to help you?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.8115537414529863
    },
    {
      "id": 37,
      "question": "Do you practice meditation or yoga outdoors? Would you like to? What is your favourite place to practice or where would you most like to practice? Does the place where you practice make any difference?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.815060302388507
    },
    {
      "id": 33,
      "question": "What kind of teachers/rolemodels did you meet on your meditation journey and would you recommend them?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.8199642090226853
    },
    {
      "id": 1,
      "question": "Do you think meditation is good for health? What about mental health?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.8399207200474459,
      "status": "approved"
    },
    {
      "id": 28,
      "question": "“I can meditate for a long time even though I am very tired as long as my mind is clear of thoughts. As soon as I start thinking about something, I fall asleep.”\nDo you experience this? How do you explain it? Isn’t it the opposite of what you might expect?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.8822885687178628
    },
    {
      "id": 15,
      "question": "It has been said that the term \"bisexual\" is insensitive because it implies that \"there are only two genders\". With more and more people exploring their gender identities and concluding that they don't fit into either male or female, it is said that the term \"pansexual\" is preferred for people sexually attracted to \"all\" (previously \"both\") genders. What are your thoughts?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.9173895207927796
    },
    {
      "id": 13,
      "question": "Some people separate the spiritual and sexual aspects of their lives. For others, sex and sexuality are integral to their spirituality. Where are you on this spectrum?",
      "asked": 0,
      "replies": 0,
      "addedby": "marq_andrew",
      "status": "approved",
      "reviewedby": "marq_andrew",
      "askedtime": null,
      "random": 0.9667159582390856
    }
  ],
  "starttime": "2021-10-14T06:30:48.414Z"
}