{
  "hangout-room": "hangout-room is a voice and/or video room for anything sfw and not necessarily related to meditation.",
  "open-meditation-room": "Open-meditation-room is for unscheduled, random meditation alone or with whoever wants to join. Microphone off please. Bow (or just nod) with palms together when you enter or leave the room, not when others do. Better not to sit directly facing the camera. People will be facing a wall in some forms of meditation. It’s okay to have your back to the camera.",
  "scheduled-meditation-room": "scheduled-meditation-room is for if we have a specific meditation meeting or class. Etiquette set by the event organiser.",
  "nsfw-nude-meditation-room": "nsfw-nude-meditation-room is where you can meditate online and nude. Be nude, honest and exposed in this room. You can hide your genitals behind your mudra or slightly off camera if you want to. Microphone off. Bow when entering and leaving. No sexual acts.",
  "nsfw-nude-yoga-room": "nsfw-nude-yoga-room is where you can practice yoga online and be nude. Microphone off unless you are leading a session. Bow when entering and leaving. No sexual acts.",
  "open-yoga-room": "open-yoga-room is where you can practice yoga online. Microphone off unless you are leading a session. Bow when entering and leaving.",
  "nsfw-other-room": "There aren’t any rules here. Yes, this is a place where you can masturbate or otherwise behave sexually online either alone or with others,where you can observe, be observed or both. There are many servers on Discord where you can jerk-off with other guys on camera, (and you can also do it privately in direct messages), so what is different about this one?\nThis is a group focussed on meditation and yoga and by extension, mindfulness, self-awareness, self-realisation, embodiment and self-acceptance. Hopefully we can bring some of those aims to our sexual or otherwise behaviour in this channel. If there are any rules they are to accept others but more importantly accept ourselves."
}